## Q1：您的性别 ##
sex_map = {'男':0, '女':1}
## Q2：您的年龄 ##
age_map = {
    '14岁以下':0, 
    '14-24岁':1, 
    '25-40岁':2,
    '41-55岁':3, 
    '56-70岁':4,
    '70岁以上':5
}
## Q3：您的最高学历（含目前在读）是？ ##
education_map = {
    '初中以下':0, 
    '高中/中专/技校':1, 
    '大学专科':2, 
    '大学本科':3, 
    '硕士研究生及以上':4
}
## Q4：您目前的职业是？ ##
profession_map = {
    '在校学生':0, 
    '政府/机关干部/公务员':1, 
    '企业管理者（包括基层及中高层管理者）':2, 
    '普通职员（办公室/写字楼工作人员）':3, 
    '专业人员（如医生/律师/文体/记者/老师等）':4, 
    '普通工人（如工厂工人/体力劳动者等）':5, 
    '商业服务业职工（如销售人员/商店职员/服务员等）':6, 
    '个体经营者/承包商 ':7, 
    '自由职业者':8, 
    '农林牧渔劳动者':9,
    '退休':10,
    '全职家长':11,
    '其他职业人员（请注明）':12
}
## Q5：您的平均税前年收入是多少元？ ##
annual_pay_map = {
    '5万以下':0, 
    '5万-15万':1, 
    '15万-25万':2, 
    '25万-35万':3, 
    '35-50万':4, 
    '50万以上':5
}
## Q6：您家中常住成员是？ ##
family_num_map = {
    '独居':0, 
    '情侣/夫妻二人':1, 
    '夫妻带小孩同住':2, 
    '夫妻、长辈、和小孩同住':3, 
    '其他':4
}
## Q7：您目前居住的房屋是？ ##
residence_type_map = {
    '宅基地自建房':0, 
    '单位大院、职工宿舍、回迁房':1, 
    '小区：多层洋房（7层及以下）':2, 
    '小区：高层电梯房':3, 
    '小区：别墅排屋':4, 
    '公寓房':5
}
## Q8：您所居住的社区活动空间以及绿化环境如何？ ##
community_space_map = {
    '非常好':0, 
    '比较好':1, 
    '一般':2, 
    '不太好':3, 
    '非常不好':4
}
## Q9：您在社区的户外活动（散步、娱乐休憩等）频率大概是多久？ ##
exercise_frequency_map = {
    '每天':0, 
    '一周4-5次':1, 
    '一周2-3次':2, 
    '一周1次':3, 
    '几乎不做停留':4
}

##########################################################################################
##########################################################################################

## Q10：以下的屋顶花园形式您更偏爱哪种？ ##
roof_type_map = {
    '空屋顶':0, 
    '草坪屋顶绿化':1, 
    '花园屋顶绿化':2
}
## Q11：如果您所在的社区建成屋顶花园是否想去活动？ ##
roof_activity_desire_map = {
    '非常想去':0, 
    '想去':1, 
    '一般':2, 
    '想去':3, 
    '非常不想去':4
}

##########################################################################################
## Q12：花卉、草坪、树木等植物观赏空间 ##
## Q13：喝茶、阅读、冥想、休闲等休憩空间 ##
## Q14：散步、慢跑、瑜伽、乒乓球、羽毛球等运动健康空间 ##
## Q15：聊天、派对、沙龙等聚会空间 ##
##########################################################################################
##########################################################################################
## Q16：新鲜无污染的瓜果蔬菜等农作物种植采摘空间 ##
## Q17：冷餐会、果蔬轻食分享等餐饮空间 ##
## Q18：果蔬集市、跳蚤市场等展示销售空间 ##
##########################################################################################
##########################################################################################
## Q19：雨水收集、污水处理等水资源回收利用空间 ##
## Q20：厨余垃圾堆肥、废旧物再利用等垃圾精细化分类空间 ##
## Q21：光伏发电、太阳能照明等再生能源利用空间 ##
## Q22：城市蜂房、生态鸟屋等动物友好空间 ##
##########################################################################################
##########################################################################################
## Q23：识农教育、植物认知、昆虫观察等儿童自然教育空间 ##
## Q24：体现社区文化的艺术装置、景观雕塑等 ##
## Q25：画展、音乐会、节庆活动等艺文空间 ##
##########################################################################################
## Q26：除此之外，您还对屋顶花园有哪些功能需求 ##
##########################################################################################